# Tile Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Tile Class
Members See Also
---
A static class that provides access to the property names that appear in the Tile visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class Tile
```

Visual Basic
---
```text
Public NotInheritable Class Tile
```

Visual C++
---
```text
public ref class Tile abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..Tile
# See Also
Tile Members
Autodesk.Revit.DB.Visual Namespace